УТ_для_edt/src/InformationRegisters/CRM_ПланыПроектов/CRM_ПланыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ПланыПроектов</name>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Трудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.CRM_ЭтапыПроектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаКонца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_ТипыЭтапов/CRM_ТипыЭтапов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ТипыЭтапов</name>
  <enumValues>
    <name>Этап</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяТочка</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/CRM_ЭтапКалендарногоПлана/CRM_ЭтапКалендарногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_ЭтапКалендарногоПлана</name>
  <basedOn>Catalog.CRM_ЭтапыПроектов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.CRM_ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаОкончания</name>
    <comment>Фактическая дата окончания задачи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <comment>Описание результата закрытия точки</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыЭтаповКалендарногоПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Название задачи проекта или контрольной точки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.CRM_ТипыЭтапов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОтменыЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <comment>Признак того что этап введен вручную</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыКонтекстаФайлов</name>
    <attributes>
      <name>ВариантКонтекстаФайлов</name>
      <type>
        <types>CatalogRef.CRM_ВариантыКонтекстаФайла</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Смещения</name>
    <comment>История смещения сроков КТ</comment>
    <attributes>
      <name>СмещениеДатаНачало</name>
      <comment>История смещенной даты</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеДатаОкончание</name>
      <comment>История смещений даты</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Обязателен для заполнения</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <comment>Автор изменения</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <comment>Участники и ответственные по задаче/контрольной точке</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>Признак ответственного</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйДляОтбора</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/CRM_ПланыПроектов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоНовый = Не РеквизитФормыВЗначение("Запись").Выбран();
	
	Если ЗначениеЗаполнено(Запись.Проект) И НЕ ЗначениеЗаполнено(Запись.Подразделение) Тогда
		Запись.Подразделение = Запись.Проект.CRM_Подразделение;
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаНачалаАРМ") Тогда
		ДатаНачалаАРМ = Параметры.ДатаНачалаАРМ;
	КонецЕсли;
	Если Параметры.Свойство("ДатаКонцаАРМ") Тогда
		ДатаКонцаАРМ = Параметры.ДатаКонцаАРМ;
	КонецЕсли;
	
	ТекДата = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	Если Не ЗначениеЗаполнено(ДатаНачалаАРМ) Тогда
		Если ЗначениеЗаполнено(Запись.ДатаНачала) Тогда
			ДатаНачалаАРМ = НачалоГода(Запись.ДатаНачала);
		Иначе
			ДатаНачалаАРМ = НачалоГода(ТекДата);
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаКонцаАРМ) Тогда
		Если ЗначениеЗаполнено(Запись.ДатаКонца) Тогда
			ДатаКонцаАРМ = КонецГода(Запись.ДатаКонца);
		Иначе
			ДатаКонцаАРМ = Макс(КонецГода(ДатаНачалаАРМ));
		КонецЕсли;
	КонецЕсли;
	ДатаНачалаАРМ = НачалоДня(ДатаНачалаАРМ);
	ДатаКонцаАРМ = КонецДня(ДатаКонцаАРМ);
	
	Если ЭтоНовый Тогда
		Запись.ПроцентЗагрузки = 100;
		
		РассчитатьПродолжительность(ЭтотОбъект);
		РассчитатьТрудоемкость();
	КонецЕсли;
	
	Если ЭтоНовый Тогда
		СоздатьКонтрольнуюТочкуНачала		= Истина;
		СоздатьКонтрольнуюТочкуОкончания	= Истина;
	КонецЕсли;
	
	УстановитьОтборыКонтрольныхТочек(ЭтотОбъект);
	
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПередЗакрытием".
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда Возврат; КонецЕсли;
	Если ФлагОтказОтЗакрытияФормы Тогда
		ФлагОтказОтЗакрытияФормы = Ложь;
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(Запись.Проект) И Запись.Проект.CRM_ЭтоПроект Тогда
		ПроверяемыеРеквизиты.Добавить("Этап");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Запись.Проект.CRM_ЭтоПроект Тогда
		Запись.Этап = Неопределено;
	КонецЕсли;
	ТекущийОбъект.ДатаИзменения = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	ТекущийОбъект.АвторИзменения = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Создание контрольных точек - если установлены соответствующие флажки.
	ФлагОтказОтЗакрытияФормы = Ложь;
	
	СтруктураРабочихВремен = Неопределено;
	Если СоздатьКонтрольнуюТочкуНачала Или СоздатьКонтрольнуюТочкуОкончания Тогда
		СтруктураРабочихВремен = CRM_ОбщегоНазначенияСервер.ПолучитьСтруктуруРабочихВременПользователя();
	КонецЕсли;
	
	бОшибкаПриСозданииКонтрольнойТочкиНачала = Ложь;
	Если СоздатьКонтрольнуюТочкуНачала Тогда
		
		КТНачала = РегистрыСведений.CRM_ПланыПроектов.СоздатьКонтрольнуюТочку(Запись.Проект, Запись.Этап, Запись.Исполнитель, Запись.Подразделение, Запись.ДатаНачала, Истина);
		
		Если ТипЗнч(КТНачала) = Тип("Строка") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка при создании контрольной точки начала:';en='Error during creation of check point of the beginning:'") + " """ + КТНачала + """",, "СоздатьКонтрольнуюТочкуНачала");
			
			бОшибкаПриСозданииКонтрольнойТочкиНачала = Истина;
			ФлагОтказОтЗакрытияФормы = Истина;
		Иначе
			СоздатьКонтрольнуюТочкуНачала = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если СоздатьКонтрольнуюТочкуОкончания И Не бОшибкаПриСозданииКонтрольнойТочкиНачала Тогда
		
		КТОкончания = РегистрыСведений.CRM_ПланыПроектов.СоздатьКонтрольнуюТочку(Запись.Проект, Запись.Этап, Запись.Исполнитель, Запись.Подразделение, Запись.ДатаКонца, Ложь);
		
		Если ТипЗнч(КТОкончания) = Тип("Строка") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка при создании контрольной точки окончания:';en='Error during creation of completion check point:'") + " """ + КТОкончания + """",, "СоздатьКонтрольнуюТочкуОкончания");
			
			ФлагОтказОтЗакрытияФормы = Истина;
		Иначе
			СоздатьКонтрольнуюТочкуОкончания = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.КонтрольныеТочки.Обновить();
	
	Оповестить("ОбновитьПланыПроектов",, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Запись.Подразделение = ПолучитьЗначениеРеквизита(Запись.Проект, "CRM_Подразделение");
	УстановитьОтборыКонтрольныхТочек(ЭтотОбъект);
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПриИзменении(Элемент)
	УстановитьОтборыКонтрольныхТочек(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	УстановитьОтборыКонтрольныхТочек(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	УстановитьОтборыКонтрольныхТочек(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СкорректироватьДатуНачалаДатуКонца(Истина);
	
	РассчитатьПродолжительность(ЭтотОбъект);
	
	РассчитатьТрудоемкость();
	
	УстановитьОтборыКонтрольныхТочек(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонцаПриИзменении(Элемент)
	СкорректироватьДатуНачалаДатуКонца(Ложь);
	
	РассчитатьПродолжительность(ЭтотОбъект);
	
	РассчитатьТрудоемкость();
	
	УстановитьОтборыКонтрольныхТочек(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжительностьПриИзменении(Элемент)
	Если Запись.Продолжительность <= 0 Тогда
		Запись.Продолжительность = 1;
	КонецЕсли;
	
	СекундВДне = 24 * 60 * 60;
	Запись.ДатаНачала = НачалоДня(Запись.ДатаНачала);
	Запись.ДатаКонца = Запись.ДатаНачала + СекундВДне * (Запись.Продолжительность - 1);
	
	СкорректироватьДатуНачалаДатуКонца(Ложь);
	
	РассчитатьПродолжительность(ЭтотОбъект);
	
	РассчитатьТрудоемкость();
КонецПроцедуры

&НаКлиенте
Процедура ПроцентЗагрузкиПриИзменении(Элемент)
	Если Запись.ПроцентЗагрузки > 100 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроцентЗагрузкиПриИзмененииОтвет", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Занятость ресурса > 100%! Продолжить?';en='Seizure of a resource> 100 %! Continue?'"), РежимДиалогаВопрос.ДаНет);
	Иначе	
		Если Запись.ПроцентЗагрузки <= 0 Тогда
			Запись.ПроцентЗагрузки = 100;
		КонецЕсли;
		
		РассчитатьТрудоемкость();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроцентЗагрузкиПриИзмененииОтвет(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Запись.ПроцентЗагрузки = 100;
	КонецЕсли;
	
	РассчитатьТрудоемкость();
КонецПроцедуры

&НаКлиенте
Процедура КонтрольныеТочкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Не Копирование Тогда
		Отказ = Истина;
		
		ЗначенияЗаполнения = Новый Структура();

		Если ЗначениеЗаполнено(Запись.Проект) Тогда
			ЗначенияЗаполнения.Вставить("Проект", Запись.Проект);
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись.Этап) Тогда
			ЗначенияЗаполнения.Вставить("Этап", Запись.Этап);
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись.Подразделение) Тогда
			ЗначенияЗаполнения.Вставить("Подразделение", Запись.Подразделение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись.Исполнитель) Тогда
			ЗначенияЗаполнения.Вставить("Исполнитель", Запись.Исполнитель);
		КонецЕсли;
		
		ЗначенияЗаполнения.Вставить("ТипЭтапа", ПредопределенноеЗначение("Перечисление.CRM_ТипыЭтапов.КонтрольнаяТочка"));
		
		ЗначенияЗаполнения.Вставить("ПлановаяДатаНачала", Запись.ДатаКонца);
		ЗначенияЗаполнения.Вставить("ПлановаяДатаОкончания", Запись.ДатаКонца);
		ЗначенияЗаполнения.Вставить("ПлановаяДлительность", 1);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		Форма = ПолучитьФорму("Документ.CRM_ЭтапКалендарногоПлана.ФормаОбъекта", ПараметрыФормы, Элементы.КонтрольныеТочки);
		Если Форма <> Неопределено Тогда
			Форма.Открыть();
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

///////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
// Функция возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
// Параметры:
//  СсылкаНаОбъект	- Ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита	- Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ПолучитьЗначениеРеквизита(СсылкаНаОбъект, ИмяРеквизита)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, ИмяРеквизита);
КонецФункции // ПолучитьЗначениеРеквизита()

&НаСервере
Процедура УправлениеВидимостью()
	
	Если Запись.Проект.CRM_ЭтоПроект Тогда
		Элементы.Проект.Заголовок = НСтр("ru='Проект';en='Project'");
		Элементы.Этап.Видимость = Истина;
	Иначе
		Элементы.Этап.Видимость = Ложь;
		Элементы.Проект.Заголовок = НСтр("ru='Процесс';en='Process'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьДатуНачалаДатуКонца(ПриоритетДатыНачала = Истина)
	Если ПриоритетДатыНачала Тогда
		Если Запись.ДатаНачала > Запись.ДатаКонца Тогда
			Запись.ДатаКонца = Запись.ДатаНачала;
		КонецЕсли;
	Иначе
		Если Запись.ДатаКонца < Запись.ДатаНачала Тогда
			Запись.ДатаНачала = Запись.ДатаКонца;
		КонецЕсли;
	КонецЕсли;
	
	Если ПриоритетДатыНачала Тогда
		КоличествоСекундВГоду = КонецГода(Запись.ДатаНачала) - НачалоГода(Запись.ДатаНачала);
	Иначе
		КоличествоСекундВГоду = КонецГода(Запись.ДатаКонца) - НачалоГода(Запись.ДатаКонца);
	КонецЕсли;
	
	Если Запись.ДатаКонца - Запись.ДатаНачала > КоличествоСекундВГоду Тогда
		ПоказатьПредупреждение(, НСтр("ru='Нельзя указывать период больше 1 года!';en='It is impossible to specify the period more than 1 year!'"), 5);
		
		Если ПриоритетДатыНачала Тогда
			Запись.ДатаНачала = НачалоГода(Запись.ДатаКонца);
		Иначе
			Запись.ДатаКонца = КонецГода(Запись.ДатаНачала);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьПродолжительность(Форма)
	СекундВДне = 24 * 60 * 60;
	Если НачалоДня(Форма.Запись.ДатаНачала) = НачалоДня(Форма.Запись.ДатаКонца) Тогда
		Форма.Запись.Продолжительность = 1;
	Иначе
		Форма.Запись.Продолжительность = (НачалоДня(Форма.Запись.ДатаКонца) - НачалоДня(Форма.Запись.ДатаНачала)) / СекундВДне + 1;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РассчитатьТрудоемкость()
	ДанныеТрудозатрат = CRM_ОбщегоНазначенияСервер.ПолучитьТрудозатратыЗаПериод(НачалоДня(Запись.ДатаНачала), КонецДня(Запись.ДатаКонца), Запись.Исполнитель);
	
	Запись.Трудоемкость = ДанныеТрудозатрат.ВЧасах * Запись.ПроцентЗагрузки / 100;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборыКонтрольныхТочек(Форма)
	Форма.КонтрольныеТочки.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(Форма.Запись.Проект) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Форма.КонтрольныеТочки.Отбор, "Проект", Форма.Запись.Проект, ВидСравненияКомпоновкиДанных.Равно);
		//
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.Запись.Этап) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Форма.КонтрольныеТочки.Отбор, "Этап", Форма.Запись.Этап, ВидСравненияКомпоновкиДанных.Равно);
		//
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.Запись.Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Форма.КонтрольныеТочки.Отбор, "Подразделение", Форма.Запись.Подразделение, ВидСравненияКомпоновкиДанных.Равно);
		//
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.Запись.Исполнитель) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Форма.КонтрольныеТочки.Отбор, "Участники.Пользователь", Форма.Запись.Исполнитель, ВидСравненияКомпоновкиДанных.Равно);
		//
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.Запись.ДатаНачала) И ЗначениеЗаполнено(Форма.Запись.ДатаКонца) Тогда
		
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			Форма.КонтрольныеТочки.Отбор.Элементы, "ГруппаОтборПоДате", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
			
		// Используем "ДобавитьЭлементКомпоновки" вместо "УстановитьЭлементОтбора", потому что в группе будет 2 поля с одним именем.
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "ПлановаяДатаНачала", 
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно, НачалоДня(Форма.Запись.ДатаНачала),, Истина);
			
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора, "ПлановаяДатаНачала", 
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, КонецДня(Форма.Запись.ДатаКонца),, Истина);
		//	
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ПлановаяДатаНачала", 
		//	НачалоДня(Форма.Запись.ДатаНачала), ВидСравненияКомпоновкиДанных.БольшеИлиРавно, "ПлановаяДатаНачалаС");
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ПлановаяДатаНачала", 
		//	КонецДня(Форма.Запись.ДатаКонца), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, "ПлановаяДатаНачалаПо");
		//
	КонецЕсли;
	//Если ЗначениеЗаполнено(Форма.Запись.ДатаКонца) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
	//		Форма.КонтрольныеТочки.Отбор, "ПлановаяДатаОкончания", КонецДня(Форма.Запись.ДатаКонца), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	//	//
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти
